SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_modem.h
  __IM uint32_t             STATUS_TGL;          /**< Status Register                                    */
  __IM uint32_t             STATUS2_TGL;         /**< Status Register 2                                  */
  __IM uint32_t             STATUS3_TGL;         /**< Status Register 3                                  */
  __IM uint32_t             STATUS4_TGL;         /**< ANT DIV RSSI Status                                */
  __IM uint32_t             STATUS5_TGL;         /**< Collision restart status                           */
  __IM uint32_t             STATUS6_TGL;         /**< ANT DIV Correlation Status                         */
  __IM uint32_t             STATUS7_TGL;         /**< PHASE Demod Status                                 */
  __IM uint32_t             TIMDETSTATUS_TGL;    /**< Timing Detection Status Register                   */
  __IM uint32_t             FSMSTATUS_TGL;       /**< Demod FSM Status Register                          */
  __IM uint32_t             FREQOFFEST_TGL;      /**< Frequency Offset Estimate                          */
  __IOM uint32_t            AFCADJRX_TGL;        /**< AFC Adjustment RX                                  */
  __IOM uint32_t            AFCADJTX_TGL;        /**< AFC Adjustment TX                                  */
  __IOM uint32_t            MIXCTRL_TGL;         /**< Analog mixer control                               */
  __IOM uint32_t            CTRL0_TGL;           /**< Control Register 0                                 */
  __IOM uint32_t            CTRL1_TGL;           /**< Control Register 1                                 */
  __IOM uint32_t            CTRL2_TGL;           /**< Control Register 2                                 */
  __IOM uint32_t            CTRL3_TGL;           /**< Control Register 3                                 */
  __IOM uint32_t            CTRL4_TGL;           /**< Control Register 4                                 */
  __IOM uint32_t            CTRL5_TGL;           /**< Control Register 5                                 */
  __IOM uint32_t            CTRL6_TGL;           /**< Control Register 6                                 */
  __IOM uint32_t            TXBR_TGL;            /**< Transmit baudrate                                  */
  __IOM uint32_t            RXBR_TGL;            /**< Receive Baudrate                                   */
  __IOM uint32_t            CF_TGL;              /**< Channel Filter                                     */
  __IOM uint32_t            PRE_TGL;             /**< Preamble Register                                  */
  __IOM uint32_t            SYNC0_TGL;           /**< Sync word 0                                        */
  __IOM uint32_t            SYNC1_TGL;           /**< Sync word 1                                        */
  __IOM uint32_t            TIMING_TGL;          /**< Timing Register                                    */
  __IOM uint32_t            DSSS0_TGL;           /**< DSSS symbol 0 Register                             */
  __IOM uint32_t            MODINDEX_TGL;        /**< Modulation Index                                   */
  __IOM uint32_t            AFC_TGL;             /**< Automatic Frequency Control                        */
  __IOM uint32_t            AFCADJLIM_TGL;       /**< AFC Adjustment Limit                               */
  __IOM uint32_t            SHAPING0_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING1_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING2_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING3_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING4_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING5_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING6_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING7_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING8_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING9_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING10_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING11_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING12_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING13_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING14_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING15_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            OOKSHAPING_TGL;      /**< OOK/ASK Shaping Control                            */
  __IOM uint32_t            RAMPCTRL_TGL;        /**< Ramping Register                                   */
  __IOM uint32_t            RAMPLEV_TGL;         /**< Ramping Register                                   */
  __IOM uint32_t            ANARAMPCTRL_TGL;     /**< Analog Ramping Control                             */
  __IOM uint32_t            ANARAMP0_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP1_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP2_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP3_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP4_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP5_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP6_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP7_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP8_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP9_TGL;        /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            ANARAMP10_TGL;       /**< Analog Ramp LUT entries                            */
  __IOM uint32_t            DCCOMP_TGL;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t            DCCOMPFILTINIT_TGL;  /**< DC Offset compensation Filter                      */
  __IM uint32_t             DCESTI_TGL;          /**< DC Offset Estimated value                          */
  __IOM uint32_t            SRCCHF_TGL;          /**< SRC ratio values and channel filter                */
  __IOM uint32_t            INTAFC_TGL;          /**< Internal AFC                                       */
  __IOM uint32_t            DSATHD0_TGL;         /**< DSA detector threshold-0                           */
  __IOM uint32_t            DSATHD1_TGL;         /**< DSA detector threshold-1                           */
  __IOM uint32_t            DSATHD2_TGL;         /**< DSA detector threshold-2                           */
  __IOM uint32_t            DSATHD3_TGL;         /**< DSA detector threshold 3                           */
  __IOM uint32_t            DSATHD4_TGL;         /**< DSA detector threshold 4                           */
  __IOM uint32_t            DSACTRL_TGL;         /**< DSA mode                                           */
  __IOM uint32_t            DIGMIXCTRL_TGL;      /**< Digital mixer control register                     */
  __IOM uint32_t            VITERBIDEMOD_TGL;    /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG0_TGL;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG1_TGL;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTTRACK_TGL;         /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t            VTBLETIMING_TGL;     /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t             BREST_TGL;           /**< Baudrate Estimate                                  */
  __IOM uint32_t            AUTOCG_TGL;          /**< Automatic clock gating                             */
  __IOM uint32_t            CGCLKSTOP_TGL;       /**< Automatic clock gating                             */
  __IM uint32_t             POE_TGL;             /**< Phase Offset Estimate                              */
  __IOM uint32_t            DIRECTMODE_TGL;      /**< Direct Mode Control                                */
  uint32_t                  RESERVED21[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            LONGRANGE1_TGL;      /**< BLE Long Range Set1                                */
  __IOM uint32_t            LONGRANGE2_TGL;      /**< BLE Long Range Set2                                */
  __IOM uint32_t            LONGRANGE3_TGL;      /**< BLE Long Range Set3                                */
  __IOM uint32_t            LONGRANGE4_TGL;      /**< BLE Long Range Set4                                */
  __IOM uint32_t            LONGRANGE5_TGL;      /**< BLE Long Range Set5                                */
  __IOM uint32_t            LONGRANGE6_TGL;      /**< BLE Long Range Set6                                */
  __IOM uint32_t            LRFRC_TGL;           /**< BLE Long Range FRC interface                       */
  __IOM uint32_t            COH0_TGL;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH1_TGL;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH2_TGL;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH3_TGL;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            CMD_TGL;             /**< Command register                                   */
  uint32_t                  RESERVED22[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            SYNCPROPERTIES_TGL;  /**< Sync word properties                               */
  __IOM uint32_t            DIGIGAINCTRL_TGL;    /**< Digital Gain Control                               */
  __IOM uint32_t            PRSCTRL_TGL;         /**< Mux control for PRS outputs                        */
  uint32_t                  RESERVED23[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            REALTIMCFE_TGL;      /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t            ETSCTRL_TGL;         /**< Early Time Stamp Control                           */
  __IOM uint32_t            ETSTIM_TGL;          /**< Early Time Stamp Timing                            */
  __IOM uint32_t            ANTSWCTRL_TGL;       /**< Antenna Switch Control                             */
  __IOM uint32_t            ANTSWCTRL1_TGL;      /**< Antenna Switch Control 1                           */
  __IOM uint32_t            ANTSWSTART_TGL;      /**< Antenna Switch Start                               */
  __IOM uint32_t            ANTSWEND_TGL;        /**< Antenna Switch End                                 */
  __IOM uint32_t            TRECPMPATT_TGL;      /**< TRECS Preamble pattern                             */
  __IOM uint32_t            TRECPMDET_TGL;       /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t            TRECSCFG_TGL;        /**< TRECS configuration                                */
  __IOM uint32_t            CFGANTPATT_TGL;      /**< Configure Antenna Pattern                          */
  uint32_t                  RESERVED24[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            CHFCOE00_TGL;        /**< CHF COE. Set0 group0                               */
  __IOM uint32_t            CHFCOE01_TGL;        /**< CHF COE. Set0 group1                               */
  __IOM uint32_t            CHFCOE02_TGL;        /**< CHF COE. Set0 group2                               */
  __IOM uint32_t            CHFCOE03_TGL;        /**< CHF COE. Set0 group3                               */
  __IOM uint32_t            CHFCOE04_TGL;        /**< CHF COE. Set0 group4                               */
  __IOM uint32_t            CHFCOE05_TGL;        /**< CHF COE. Set0 group5                               */
  __IOM uint32_t            CHFCOE06_TGL;        /**< CHF COE. Set0 group6                               */
  __IOM uint32_t            CHFCOE10_TGL;        /**< CHF COE. Set1 group0                               */
  __IOM uint32_t            CHFCOE11_TGL;        /**< CHF COE. Set1 group1                               */
  __IOM uint32_t            CHFCOE12_TGL;        /**< CHF COE. Set1 group2                               */
  __IOM uint32_t            CHFCOE13_TGL;        /**< CHF COE. Set1 group3                               */
  __IOM uint32_t            CHFCOE14_TGL;        /**< CHF COE. Set1 group4                               */
  __IOM uint32_t            CHFCOE15_TGL;        /**< CHF COE. Set1 group5                               */
  __IOM uint32_t            CHFCOE16_TGL;        /**< CHF COE. Set1 group6                               */
  __IOM uint32_t            CHFCTRL_TGL;         /**< CHF control                                        */
  __IOM uint32_t            CHFLATENCYCTRL_TGL;  /**< CHF Latency Control                                */
  __IOM uint32_t            FRMSCHTIME_TGL;      /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t            PREFILTCOEFF_TGL;    /**< Preamble Filter Coefficients                       */
  __IOM uint32_t            RXRESTART_TGL;       /**< Collision restart control                          */
  __IOM uint32_t            SQ_TGL;              /**< Preamble Sense Mode                                */
  __IOM uint32_t            SQEXT_TGL;           /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t            SQI_TGL;             /**< Signal quality indicator                           */
  __IOM uint32_t            ANTDIVCTRL_TGL;      /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t            ANTDIVFW_TGL;        /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t            PHDMODANTDIV_TGL;    /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t            PHANTDECSION_TGL;    /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t            PHDMODCTRL_TGL;      /**< PHASE DEMOD CTRL                                   */
  uint32_t                  RESERVED25[8U];      /**< Reserved for future use                            */
  __IOM uint32_t            IRCAL_TGL;           /**< IRCAL control signals                              */
  __IM uint32_t             IRCALCOEF_TGL;       /**< IRCAL COEF values                                  */
  MODEM_IRCALCOEFWR_TypeDef IRCALCOEFWR_TGL[2U]; /**< IRCAL COEFS WR per antenna                         */
  __IOM uint32_t            ADCTRL1_TGL;         /**< ADCTRL1                                            */
  __IOM uint32_t            ADCTRL2_TGL;         /**< ADCTRL2                                            */
  __IM uint32_t             ADQUAL0_TGL;         /**< ADQUAL0                                            */
  __IM uint32_t             ADQUAL1_TGL;         /**< ADQUAL1                                            */
  __IM uint32_t             ADQUAL2_TGL;         /**< ADQUAL2                                            */
  __IM uint32_t             ADQUAL3_TGL;         /**< ADQUAL3                                            */
  __IOM uint32_t            ADQUAL4_TGL;         /**< ADQUAL4                                            */
  __IOM uint32_t            ADQUAL5_TGL;         /**< ADQUAL5                                            */
  __IOM uint32_t            ADQUAL6_TGL;         /**< ADQUAL6                                            */
  __IOM uint32_t            ADQUAL7_TGL;         /**< ADQUAL7                                            */
  __IOM uint32_t            ADQUAL8_TGL;         /**< ADQUAL8                                            */
  __IM uint32_t             ADQUAL9_TGL;         /**< ADQUAL9                                            */
  __IM uint32_t             ADQUAL10_TGL;        /**< ADQUAL10                                           */
  __IOM uint32_t            ADFSM0_TGL;          /**< ADFSM0                                             */
  __IOM uint32_t            ADFSM1_TGL;          /**< ADFSM1                                             */
  __IOM uint32_t            ADFSM2_TGL;          /**< ADFSM2                                             */
  __IOM uint32_t            ADFSM3_TGL;          /**< ADFSM3                                             */
  __IOM uint32_t            ADFSM4_TGL;          /**< ADFSM4                                             */
  __IOM uint32_t            ADFSM5_TGL;          /**< ADFSM5                                             */
  __IOM uint32_t            ADFSM6_TGL;          /**< ADFSM6                                             */
  __IOM uint32_t            ADFSM7_TGL;          /**< ADFSM7                                             */
  __IOM uint32_t            ADFSM8_TGL;          /**< ADFSM8                                             */
  __IOM uint32_t            ADFSM9_TGL;          /**< ADFSM9                                             */
  __IOM uint32_t            ADFSM10_TGL;         /**< ADFSM10                                            */
  __IOM uint32_t            ADFSM11_TGL;         /**< ADFSM11                                            */
  __IOM uint32_t            ADFSM12_TGL;         /**< ADFSM12                                            */
  __IOM uint32_t            ADFSM13_TGL;         /**< ADFSM13                                            */
  __IOM uint32_t            ADFSM14_TGL;         /**< ADFSM14                                            */
  __IOM uint32_t            ADFSM15_TGL;         /**< ADFSM15                                            */
  __IOM uint32_t            ADFSM16_TGL;         /**< ADFSM16                                            */
  __IOM uint32_t            ADFSM17_TGL;         /**< ADFSM17                                            */
  __IOM uint32_t            ADFSM18_TGL;         /**< ADFSM18                                            */
  __IOM uint32_t            ADFSM19_TGL;         /**< ADFSM19                                            */
  __IOM uint32_t            ADFSM20_TGL;         /**< ADFSM20                                            */
  __IOM uint32_t            ADFSM21_TGL;         /**< ADFSM21                                            */
  __IM uint32_t             ADFSM22_TGL;         /**< ADFSM22                                            */
  __IOM uint32_t            ADFSM23_TGL;         /**< ADFSM23                                            */
  __IOM uint32_t            ADFSM24_TGL;         /**< ADFSM24                                            */
  __IOM uint32_t            ADFSM25_TGL;         /**< ADFSM25                                            */
  __IOM uint32_t            ADFSM26_TGL;         /**< ADFSM26                                            */
  __IOM uint32_t            ADFSM27_TGL;         /**< ADFSM27                                            */
  __IOM uint32_t            ADFSM28_TGL;         /**< ADFSM28                                            */
  __IOM uint32_t            ADFSM29_TGL;         /**< ADFSM29                                            */
  __IOM uint32_t            ADFSM30_TGL;         /**< ADFSM30                                            */
  __IOM uint32_t            BCRCTRL0_TGL;        /**< BCRCTRL0                                           */
  __IOM uint32_t            BCRCTRL1_TGL;        /**< BCRCTRL1                                           */
  __IOM uint32_t            BCRDEMODCTRL_TGL;    /**< BCRDEMODCTRL                                       */
  __IOM uint32_t            BCRDEMODOOK_TGL;     /**< BCRDEMODOOK                                        */
  __IOM uint32_t            BCRDEMODAFC0_TGL;    /**< BCRDEMODAFC0                                       */
  __IOM uint32_t            BCRDEMODAFC1_TGL;    /**< BCRDEMODAFC1                                       */
  __IOM uint32_t            BCRDEMOD4FSK0_TGL;   /**< BCRDEMOD4FSK0                                      */
  __IOM uint32_t            BCRDEMOD4FSK1_TGL;   /**< BCRDEMOD4FSK1                                      */
  __IOM uint32_t            BCRDEMODANT_TGL;     /**< BCRDEMODANT                                        */
  __IOM uint32_t            BCRDEMODRSSI_TGL;    /**< BCRDEMODRSSI                                       */
  __IOM uint32_t            BCRDEMODARR0_TGL;    /**< BCRDEMODARR0                                       */
  __IOM uint32_t            BCRDEMODARR1_TGL;    /**< BCRDEMODARR1                                       */
  __IOM uint32_t            BCRDEMODARR2_TGL;    /**< BCRDEMODARR2                                       */
  __IOM uint32_t            BCRDEMODKSI_TGL;     /**< BCR DEMOD KSI                                      */
  __IOM uint32_t            BCRDEMODPMEXP_TGL;   /**< BCR DEMOD PM                                       */
  uint32_t                  RESERVED26[37U];     /**< Reserved for future use                            */
  __IOM uint32_t            SPARE_TGL;           /**< Spare register                                     */
} MODEM_TypeDef;
/** @} End of group EFR32ZG23_MODEM */

/**************************************************************************//**
 * @addtogroup EFR32ZG23_MODEM
 * @{
 * @defgroup EFR32ZG23_MODEM_BitFields MODEM Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for MODEM IPVERSION */
#define _MODEM_IPVERSION_RESETVALUE                             0x00000002UL                              /**< Default value for MODEM_IPVERSION           */
#define _MODEM_IPVERSION_MASK                                   0xFFFFFFFFUL                              /**< Mask for MODEM_IPVERSION                    */
#define _MODEM_IPVERSION_IPVERSION_SHIFT                        0                                         /**< Shift value for MODEM_IPVERSION             */
#define _MODEM_IPVERSION_IPVERSION_MASK                         0xFFFFFFFFUL                              /**< Bit mask for MODEM_IPVERSION                */
#define _MODEM_IPVERSION_IPVERSION_DEFAULT                      0x00000002UL                              /**< Mode DEFAULT for MODEM_IPVERSION            */
#define MODEM_IPVERSION_IPVERSION_DEFAULT                       (_MODEM_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_IPVERSION    */

