SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_modem.h
/* Bit fields for MODEM ANARAMP9 */
#define _MODEM_ANARAMP9_RESETVALUE                              0x2307B9ADUL                                 /**< Default value for MODEM_ANARAMP9            */
#define _MODEM_ANARAMP9_MASK                                    0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP9                     */
#define _MODEM_ANARAMP9_ANARAMPLUT54_SHIFT                      0                                            /**< Shift value for MODEM_ANARAMPLUT54          */
#define _MODEM_ANARAMP9_ANARAMPLUT54_MASK                       0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT54             */
#define _MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT                    0x0000000DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT54_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT55_SHIFT                      5                                            /**< Shift value for MODEM_ANARAMPLUT55          */
#define _MODEM_ANARAMP9_ANARAMPLUT55_MASK                       0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT55             */
#define _MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT                    0x0000000DUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT55_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT56_SHIFT                      10                                           /**< Shift value for MODEM_ANARAMPLUT56          */
#define _MODEM_ANARAMP9_ANARAMPLUT56_MASK                       0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT56             */
#define _MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT                    0x0000000EUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT56_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT57_SHIFT                      15                                           /**< Shift value for MODEM_ANARAMPLUT57          */
#define _MODEM_ANARAMP9_ANARAMPLUT57_MASK                       0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT57             */
#define _MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT                    0x0000000FUL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT57_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT58_SHIFT                      20                                           /**< Shift value for MODEM_ANARAMPLUT58          */
#define _MODEM_ANARAMP9_ANARAMPLUT58_MASK                       0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT58             */
#define _MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT                    0x00000010UL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT58_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */
#define _MODEM_ANARAMP9_ANARAMPLUT59_SHIFT                      25                                           /**< Shift value for MODEM_ANARAMPLUT59          */
#define _MODEM_ANARAMP9_ANARAMPLUT59_MASK                       0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT59             */
#define _MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT                    0x00000011UL                                 /**< Mode DEFAULT for MODEM_ANARAMP9             */
#define MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT                     (_MODEM_ANARAMP9_ANARAMPLUT59_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP9     */

/* Bit fields for MODEM ANARAMP10 */
#define _MODEM_ANARAMP10_RESETVALUE                             0x000FF2F3UL                                  /**< Default value for MODEM_ANARAMP10           */
#define _MODEM_ANARAMP10_MASK                                   0x000FFFFFUL                                  /**< Mask for MODEM_ANARAMP10                    */
#define _MODEM_ANARAMP10_ANARAMPLUT60_SHIFT                     0                                             /**< Shift value for MODEM_ANARAMPLUT60          */
#define _MODEM_ANARAMP10_ANARAMPLUT60_MASK                      0x1FUL                                        /**< Bit mask for MODEM_ANARAMPLUT60             */
#define _MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT                   0x00000013UL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT                    (_MODEM_ANARAMP10_ANARAMPLUT60_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT61_SHIFT                     5                                             /**< Shift value for MODEM_ANARAMPLUT61          */
#define _MODEM_ANARAMP10_ANARAMPLUT61_MASK                      0x3E0UL                                       /**< Bit mask for MODEM_ANARAMPLUT61             */
#define _MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT                   0x00000017UL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT                    (_MODEM_ANARAMP10_ANARAMPLUT61_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT62_SHIFT                     10                                            /**< Shift value for MODEM_ANARAMPLUT62          */
#define _MODEM_ANARAMP10_ANARAMPLUT62_MASK                      0x7C00UL                                      /**< Bit mask for MODEM_ANARAMPLUT62             */
#define _MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT                   0x0000001CUL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT                    (_MODEM_ANARAMP10_ANARAMPLUT62_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */
#define _MODEM_ANARAMP10_ANARAMPLUT63_SHIFT                     15                                            /**< Shift value for MODEM_ANARAMPLUT63          */
#define _MODEM_ANARAMP10_ANARAMPLUT63_MASK                      0xF8000UL                                     /**< Bit mask for MODEM_ANARAMPLUT63             */
#define _MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT                   0x0000001FUL                                  /**< Mode DEFAULT for MODEM_ANARAMP10            */
#define MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT                    (_MODEM_ANARAMP10_ANARAMPLUT63_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP10    */

/* Bit fields for MODEM DCCOMP */
#define _MODEM_DCCOMP_RESETVALUE                                0x00000030UL                                 /**< Default value for MODEM_DCCOMP              */
#define _MODEM_DCCOMP_MASK                                      0x001FFFFFUL                                 /**< Mask for MODEM_DCCOMP                       */
#define MODEM_DCCOMP_DCESTIEN                                   (0x1UL << 0)                                 /**< DC Offset Estimation Enable                 */
#define _MODEM_DCCOMP_DCESTIEN_SHIFT                            0                                            /**< Shift value for MODEM_DCESTIEN              */
#define _MODEM_DCCOMP_DCESTIEN_MASK                             0x1UL                                        /**< Bit mask for MODEM_DCESTIEN                 */
#define _MODEM_DCCOMP_DCESTIEN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCESTIEN_DEFAULT                           (_MODEM_DCCOMP_DCESTIEN_DEFAULT << 0)        /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCCOMPEN                                   (0x1UL << 1)                                 /**< DC Offset Compensation Enable               */
#define _MODEM_DCCOMP_DCCOMPEN_SHIFT                            1                                            /**< Shift value for MODEM_DCCOMPEN              */
#define _MODEM_DCCOMP_DCCOMPEN_MASK                             0x2UL                                        /**< Bit mask for MODEM_DCCOMPEN                 */
#define _MODEM_DCCOMP_DCCOMPEN_DEFAULT                          0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPEN_DEFAULT                           (_MODEM_DCCOMP_DCCOMPEN_DEFAULT << 1)        /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCRSTEN                                    (0x1UL << 2)                                 /**< DC Compensation Filter Reset Enable         */
#define _MODEM_DCCOMP_DCRSTEN_SHIFT                             2                                            /**< Shift value for MODEM_DCRSTEN               */
#define _MODEM_DCCOMP_DCRSTEN_MASK                              0x4UL                                        /**< Bit mask for MODEM_DCRSTEN                  */
#define _MODEM_DCCOMP_DCRSTEN_DEFAULT                           0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCRSTEN_DEFAULT                            (_MODEM_DCCOMP_DCRSTEN_DEFAULT << 2)         /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCCOMPFREEZE                               (0x1UL << 3)                                 /**< DC Offset Compensation Filter Freeze        */
#define _MODEM_DCCOMP_DCCOMPFREEZE_SHIFT                        3                                            /**< Shift value for MODEM_DCCOMPFREEZE          */
#define _MODEM_DCCOMP_DCCOMPFREEZE_MASK                         0x8UL                                        /**< Bit mask for MODEM_DCCOMPFREEZE             */
#define _MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT                       (_MODEM_DCCOMP_DCCOMPFREEZE_DEFAULT << 3)    /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCCOMPGEAR_SHIFT                          4                                            /**< Shift value for MODEM_DCCOMPGEAR            */
#define _MODEM_DCCOMP_DCCOMPGEAR_MASK                           0x70UL                                       /**< Bit mask for MODEM_DCCOMPGEAR               */
#define _MODEM_DCCOMP_DCCOMPGEAR_DEFAULT                        0x00000003UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCCOMPGEAR_DEFAULT                         (_MODEM_DCCOMP_DCCOMPGEAR_DEFAULT << 4)      /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCLIMIT_SHIFT                             7                                            /**< Shift value for MODEM_DCLIMIT               */
#define _MODEM_DCCOMP_DCLIMIT_MASK                              0x180UL                                      /**< Bit mask for MODEM_DCLIMIT                  */
#define _MODEM_DCCOMP_DCLIMIT_DEFAULT                           0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALE                         0x00000000UL                                 /**< Mode FULLSCALE for MODEM_DCCOMP             */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4                      0x00000001UL                                 /**< Mode FULLSCALEBY4 for MODEM_DCCOMP          */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8                      0x00000002UL                                 /**< Mode FULLSCALEBY8 for MODEM_DCCOMP          */
#define _MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16                     0x00000003UL                                 /**< Mode FULLSCALEBY16 for MODEM_DCCOMP         */
#define MODEM_DCCOMP_DCLIMIT_DEFAULT                            (_MODEM_DCCOMP_DCLIMIT_DEFAULT << 7)         /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALE                          (_MODEM_DCCOMP_DCLIMIT_FULLSCALE << 7)       /**< Shifted mode FULLSCALE for MODEM_DCCOMP     */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4                       (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY4 << 7)    /**< Shifted mode FULLSCALEBY4 for MODEM_DCCOMP  */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8                       (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY8 << 7)    /**< Shifted mode FULLSCALEBY8 for MODEM_DCCOMP  */
#define MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16                      (_MODEM_DCCOMP_DCLIMIT_FULLSCALEBY16 << 7)   /**< Shifted mode FULLSCALEBY16 for MODEM_DCCOMP */
#define MODEM_DCCOMP_DCGAINGEAREN                               (0x1UL << 9)                                 /**< DC Offset Gain Change Filter Gear Enable    */
#define _MODEM_DCCOMP_DCGAINGEAREN_SHIFT                        9                                            /**< Shift value for MODEM_DCGAINGEAREN          */
#define _MODEM_DCCOMP_DCGAINGEAREN_MASK                         0x200UL                                      /**< Bit mask for MODEM_DCGAINGEAREN             */
#define _MODEM_DCCOMP_DCGAINGEAREN_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEAREN_DEFAULT                       (_MODEM_DCCOMP_DCGAINGEAREN_DEFAULT << 9)    /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCGAINGEAR_SHIFT                          10                                           /**< Shift value for MODEM_DCGAINGEAR            */
#define _MODEM_DCCOMP_DCGAINGEAR_MASK                           0x1C00UL                                     /**< Bit mask for MODEM_DCGAINGEAR               */
#define _MODEM_DCCOMP_DCGAINGEAR_DEFAULT                        0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEAR_DEFAULT                         (_MODEM_DCCOMP_DCGAINGEAR_DEFAULT << 10)     /**< Shifted mode DEFAULT for MODEM_DCCOMP       */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_SHIFT                      13                                           /**< Shift value for MODEM_DCGAINGEARSMPS        */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_MASK                       0x1FE000UL                                   /**< Bit mask for MODEM_DCGAINGEARSMPS           */
#define _MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCCOMP               */
#define MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT                     (_MODEM_DCCOMP_DCGAINGEARSMPS_DEFAULT << 13) /**< Shifted mode DEFAULT for MODEM_DCCOMP       */

/* Bit fields for MODEM DCCOMPFILTINIT */
#define _MODEM_DCCOMPFILTINIT_RESETVALUE                        0x00000000UL                                         /**< Default value for MODEM_DCCOMPFILTINIT      */
#define _MODEM_DCCOMPFILTINIT_MASK                              0x7FFFFFFFUL                                         /**< Mask for MODEM_DCCOMPFILTINIT               */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_SHIFT              0                                                    /**< Shift value for MODEM_DCCOMPINITVALI        */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_MASK               0x7FFFUL                                             /**< Bit mask for MODEM_DCCOMPINITVALI           */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT            0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT             (_MODEM_DCCOMPFILTINIT_DCCOMPINITVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_SHIFT              15                                                   /**< Shift value for MODEM_DCCOMPINITVALQ        */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_MASK               0x3FFF8000UL                                         /**< Bit mask for MODEM_DCCOMPINITVALQ           */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT            0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT             (_MODEM_DCCOMPFILTINIT_DCCOMPINITVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT                         (0x1UL << 30)                                        /**< Initialize filter state                     */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_SHIFT                  30                                                   /**< Shift value for MODEM_DCCOMPINIT            */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_MASK                   0x40000000UL                                         /**< Bit mask for MODEM_DCCOMPINIT               */
#define _MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT                0x00000000UL                                         /**< Mode DEFAULT for MODEM_DCCOMPFILTINIT       */
#define MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT                 (_MODEM_DCCOMPFILTINIT_DCCOMPINIT_DEFAULT << 30)     /**< Shifted mode DEFAULT for MODEM_DCCOMPFILTINIT*/

/* Bit fields for MODEM DCESTI */
#define _MODEM_DCESTI_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_DCESTI              */
#define _MODEM_DCESTI_MASK                                      0x3FFFFFFFUL                                 /**< Mask for MODEM_DCESTI                       */
#define _MODEM_DCESTI_DCCOMPESTIVALI_SHIFT                      0                                            /**< Shift value for MODEM_DCCOMPESTIVALI        */
#define _MODEM_DCESTI_DCCOMPESTIVALI_MASK                       0x7FFFUL                                     /**< Bit mask for MODEM_DCCOMPESTIVALI           */
#define _MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCESTI               */
#define MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT                     (_MODEM_DCESTI_DCCOMPESTIVALI_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_DCESTI       */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_SHIFT                      15                                           /**< Shift value for MODEM_DCCOMPESTIVALQ        */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_MASK                       0x3FFF8000UL                                 /**< Bit mask for MODEM_DCCOMPESTIVALQ           */
#define _MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_DCESTI               */
#define MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT                     (_MODEM_DCESTI_DCCOMPESTIVALQ_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_DCESTI       */

