SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_modem.h
/* Bit fields for MODEM ADFSM2 */
#define _MODEM_ADFSM2_RESETVALUE                                0x00000000UL                               /**< Default value for MODEM_ADFSM2              */
#define _MODEM_ADFSM2_MASK                                      0xFFFFFFFFUL                               /**< Mask for MODEM_ADFSM2                       */
#define _MODEM_ADFSM2_ADOSWITCHANT_SHIFT                        0                                          /**< Shift value for MODEM_ADOSWITCHANT          */
#define _MODEM_ADFSM2_ADOSWITCHANT_MASK                         0xFFFFUL                                   /**< Bit mask for MODEM_ADOSWITCHANT             */
#define _MODEM_ADFSM2_ADOSWITCHANT_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_ADFSM2               */
#define MODEM_ADFSM2_ADOSWITCHANT_DEFAULT                       (_MODEM_ADFSM2_ADOSWITCHANT_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM2       */
#define _MODEM_ADFSM2_ADORESTARTRX_SHIFT                        16                                         /**< Shift value for MODEM_ADORESTARTRX          */
#define _MODEM_ADFSM2_ADORESTARTRX_MASK                         0xFFFF0000UL                               /**< Bit mask for MODEM_ADORESTARTRX             */
#define _MODEM_ADFSM2_ADORESTARTRX_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_ADFSM2               */
#define MODEM_ADFSM2_ADORESTARTRX_DEFAULT                       (_MODEM_ADFSM2_ADORESTARTRX_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM2       */

/* Bit fields for MODEM ADFSM3 */
#define _MODEM_ADFSM3_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADFSM3              */
#define _MODEM_ADFSM3_MASK                                      0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM3                       */
#define _MODEM_ADFSM3_ADOQUAL0UPDATE_SHIFT                      0                                            /**< Shift value for MODEM_ADOQUAL0UPDATE        */
#define _MODEM_ADFSM3_ADOQUAL0UPDATE_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADOQUAL0UPDATE           */
#define _MODEM_ADFSM3_ADOQUAL0UPDATE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM3               */
#define MODEM_ADFSM3_ADOQUAL0UPDATE_DEFAULT                     (_MODEM_ADFSM3_ADOQUAL0UPDATE_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM3       */
#define _MODEM_ADFSM3_ADOQUAL1UPDATE_SHIFT                      16                                           /**< Shift value for MODEM_ADOQUAL1UPDATE        */
#define _MODEM_ADFSM3_ADOQUAL1UPDATE_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADOQUAL1UPDATE           */
#define _MODEM_ADFSM3_ADOQUAL1UPDATE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM3               */
#define MODEM_ADFSM3_ADOQUAL1UPDATE_DEFAULT                     (_MODEM_ADFSM3_ADOQUAL1UPDATE_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM3       */

/* Bit fields for MODEM ADFSM4 */
#define _MODEM_ADFSM4_RESETVALUE                                0x00000000UL                                /**< Default value for MODEM_ADFSM4              */
#define _MODEM_ADFSM4_MASK                                      0xFFFFFFFFUL                                /**< Mask for MODEM_ADFSM4                       */
#define _MODEM_ADFSM4_ADOQUAL0CLEAR_SHIFT                       0                                           /**< Shift value for MODEM_ADOQUAL0CLEAR         */
#define _MODEM_ADFSM4_ADOQUAL0CLEAR_MASK                        0xFFFFUL                                    /**< Bit mask for MODEM_ADOQUAL0CLEAR            */
#define _MODEM_ADFSM4_ADOQUAL0CLEAR_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM4               */
#define MODEM_ADFSM4_ADOQUAL0CLEAR_DEFAULT                      (_MODEM_ADFSM4_ADOQUAL0CLEAR_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM4       */
#define _MODEM_ADFSM4_ADOQUAL1CLEAR_SHIFT                       16                                          /**< Shift value for MODEM_ADOQUAL1CLEAR         */
#define _MODEM_ADFSM4_ADOQUAL1CLEAR_MASK                        0xFFFF0000UL                                /**< Bit mask for MODEM_ADOQUAL1CLEAR            */
#define _MODEM_ADFSM4_ADOQUAL1CLEAR_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM4               */
#define MODEM_ADFSM4_ADOQUAL1CLEAR_DEFAULT                      (_MODEM_ADFSM4_ADOQUAL1CLEAR_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM4       */

/* Bit fields for MODEM ADFSM5 */
#define _MODEM_ADFSM5_RESETVALUE                                0x00000000UL                        /**< Default value for MODEM_ADFSM5              */
#define _MODEM_ADFSM5_MASK                                      0xFFFFFFFFUL                        /**< Mask for MODEM_ADFSM5                       */
#define _MODEM_ADFSM5_ADOMUX_SHIFT                              0                                   /**< Shift value for MODEM_ADOMUX                */
#define _MODEM_ADFSM5_ADOMUX_MASK                               0xFFFFFFFFUL                        /**< Bit mask for MODEM_ADOMUX                   */
#define _MODEM_ADFSM5_ADOMUX_DEFAULT                            0x00000000UL                        /**< Mode DEFAULT for MODEM_ADFSM5               */
#define MODEM_ADFSM5_ADOMUX_DEFAULT                             (_MODEM_ADFSM5_ADOMUX_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM5       */

/* Bit fields for MODEM ADFSM6 */
#define _MODEM_ADFSM6_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADFSM6              */
#define _MODEM_ADFSM6_MASK                                      0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM6                       */
#define _MODEM_ADFSM6_ADNEXTSTATESW0_SHIFT                      0                                            /**< Shift value for MODEM_ADNEXTSTATESW0        */
#define _MODEM_ADFSM6_ADNEXTSTATESW0_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADNEXTSTATESW0           */
#define _MODEM_ADFSM6_ADNEXTSTATESW0_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM6               */
#define MODEM_ADFSM6_ADNEXTSTATESW0_DEFAULT                     (_MODEM_ADFSM6_ADNEXTSTATESW0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM6       */
#define _MODEM_ADFSM6_ADNEXTSTATESW1_SHIFT                      16                                           /**< Shift value for MODEM_ADNEXTSTATESW1        */
#define _MODEM_ADFSM6_ADNEXTSTATESW1_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADNEXTSTATESW1           */
#define _MODEM_ADFSM6_ADNEXTSTATESW1_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM6               */
#define MODEM_ADFSM6_ADNEXTSTATESW1_DEFAULT                     (_MODEM_ADFSM6_ADNEXTSTATESW1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM6       */

/* Bit fields for MODEM ADFSM7 */
#define _MODEM_ADFSM7_RESETVALUE                                0x00000000UL                                 /**< Default value for MODEM_ADFSM7              */
#define _MODEM_ADFSM7_MASK                                      0xFFFFFFFFUL                                 /**< Mask for MODEM_ADFSM7                       */
#define _MODEM_ADFSM7_ADNEXTSTATESW2_SHIFT                      0                                            /**< Shift value for MODEM_ADNEXTSTATESW2        */
#define _MODEM_ADFSM7_ADNEXTSTATESW2_MASK                       0xFFFFUL                                     /**< Bit mask for MODEM_ADNEXTSTATESW2           */
#define _MODEM_ADFSM7_ADNEXTSTATESW2_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM7               */
#define MODEM_ADFSM7_ADNEXTSTATESW2_DEFAULT                     (_MODEM_ADFSM7_ADNEXTSTATESW2_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADFSM7       */
#define _MODEM_ADFSM7_ADNEXTSTATESW3_SHIFT                      16                                           /**< Shift value for MODEM_ADNEXTSTATESW3        */
#define _MODEM_ADFSM7_ADNEXTSTATESW3_MASK                       0xFFFF0000UL                                 /**< Bit mask for MODEM_ADNEXTSTATESW3           */
#define _MODEM_ADFSM7_ADNEXTSTATESW3_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_ADFSM7               */
#define MODEM_ADFSM7_ADNEXTSTATESW3_DEFAULT                     (_MODEM_ADFSM7_ADNEXTSTATESW3_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADFSM7       */

