SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_modem.h
/* Bit fields for MODEM BCRDEMODRSSI */
#define _MODEM_BCRDEMODRSSI_RESETVALUE                          0x60000020UL                                    /**< Default value for MODEM_BCRDEMODRSSI        */
#define _MODEM_BCRDEMODRSSI_MASK                                0xFE001DFFUL                                    /**< Mask for MODEM_BCRDEMODRSSI                 */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_SHIFT                    0                                               /**< Shift value for MODEM_RSSIARRTHD            */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_MASK                     0xFFUL                                          /**< Bit mask for MODEM_RSSIARRTHD               */
#define _MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT                  0x00000020UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT                   (_MODEM_BCRDEMODRSSI_RSSIARRTHD_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define MODEM_BCRDEMODRSSI_RSSIMATAP                            (0x1UL << 8)                                    /**< RSSIMATAP                                   */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_SHIFT                     8                                               /**< Shift value for MODEM_RSSIMATAP             */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_MASK                      0x100UL                                         /**< Bit mask for MODEM_RSSIMATAP                */
#define _MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT                    (_MODEM_BCRDEMODRSSI_RSSIMATAP_DEFAULT << 8)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_SHIFT                   10                                              /**< Shift value for MODEM_MUTERSSICNT           */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_MASK                    0x1C00UL                                        /**< Bit mask for MODEM_MUTERSSICNT              */
#define _MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT                  (_MODEM_BCRDEMODRSSI_MUTERSSICNT_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_SHIFT                     25                                              /**< Shift value for MODEM_PRWOFFSET             */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_MASK                      0xFE000000UL                                    /**< Bit mask for MODEM_PRWOFFSET                */
#define _MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT                   0x00000030UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODRSSI         */
#define MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT                    (_MODEM_BCRDEMODRSSI_PRWOFFSET_DEFAULT << 25)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODRSSI */

/* Bit fields for MODEM BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_RESETVALUE                          0x00600026UL                                    /**< Default value for MODEM_BCRDEMODARR0        */
#define _MODEM_BCRDEMODARR0_MASK                                0xFFFFFFFFUL                                    /**< Mask for MODEM_BCRDEMODARR0                 */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_SHIFT                      0                                               /**< Shift value for MODEM_SCHPRDLO              */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_MASK                       0x7UL                                           /**< Bit mask for MODEM_SCHPRDLO                 */
#define _MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT                    0x00000006UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT                     (_MODEM_BCRDEMODARR0_SCHPRDLO_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_EYEQUALEN                            (0x1UL << 3)                                    /**< EYEQUALEN                                   */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_SHIFT                     3                                               /**< Shift value for MODEM_EYEQUALEN             */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_MASK                      0x8UL                                           /**< Bit mask for MODEM_EYEQUALEN                */
#define _MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT                    (_MODEM_BCRDEMODARR0_EYEQUALEN_DEFAULT << 3)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_SHIFT                      4                                               /**< Shift value for MODEM_SCHPRDHI              */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_MASK                       0x70UL                                          /**< Bit mask for MODEM_SCHPRDHI                 */
#define _MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT                    0x00000002UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT                     (_MODEM_BCRDEMODARR0_SCHPRDHI_DEFAULT << 4)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRRSTEN                             (0x1UL << 7)                                    /**< ARRRSTEN                                    */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_SHIFT                      7                                               /**< Shift value for MODEM_ARRRSTEN              */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_MASK                       0x80UL                                          /**< Bit mask for MODEM_ARRRSTEN                 */
#define _MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT                     (_MODEM_BCRDEMODARR0_ARRRSTEN_DEFAULT << 7)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRTOLER_SHIFT                      8                                               /**< Shift value for MODEM_ARRTOLER              */
#define _MODEM_BCRDEMODARR0_ARRTOLER_MASK                       0x1F00UL                                        /**< Bit mask for MODEM_ARRTOLER                 */
#define _MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT                     (_MODEM_BCRDEMODARR0_ARRTOLER_DEFAULT << 8)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_DIFF0RSTEN                           (0x1UL << 13)                                   /**< DIFF0RSTEN                                  */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_SHIFT                    13                                              /**< Shift value for MODEM_DIFF0RSTEN            */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_MASK                     0x2000UL                                        /**< Bit mask for MODEM_DIFF0RSTEN               */
#define _MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT                   (_MODEM_BCRDEMODARR0_DIFF0RSTEN_DEFAULT << 13)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_SHIFT                    14                                              /**< Shift value for MODEM_PHSPIKETHD            */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_MASK                     0x1FC000UL                                      /**< Bit mask for MODEM_PHSPIKETHD               */
#define _MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT                   (_MODEM_BCRDEMODARR0_PHSPIKETHD_DEFAULT << 14)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_SHIFT                     21                                              /**< Shift value for MODEM_ARRDETTHD             */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_MASK                      0x1E00000UL                                     /**< Bit mask for MODEM_ARRDETTHD                */
#define _MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT                   0x00000003UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT                    (_MODEM_BCRDEMODARR0_ARRDETTHD_DEFAULT << 21)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_SCHFRZEN                             (0x1UL << 25)                                   /**< SCHFRZEN                                    */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_SHIFT                      25                                              /**< Shift value for MODEM_SCHFRZEN              */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_MASK                       0x2000000UL                                     /**< Bit mask for MODEM_SCHFRZEN                 */
#define _MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT                     (_MODEM_BCRDEMODARR0_SCHFRZEN_DEFAULT << 25)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_EYEXESTEN                            (0x1UL << 26)                                   /**< EYEXESTEN                                   */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_SHIFT                     26                                              /**< Shift value for MODEM_EYEXESTEN             */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_MASK                      0x4000000UL                                     /**< Bit mask for MODEM_EYEXESTEN                */
#define _MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT                    (_MODEM_BCRDEMODARR0_EYEXESTEN_DEFAULT << 26)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_EYEXESTFAST                          (0x1UL << 27)                                   /**< EYEXESTFAST                                 */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_SHIFT                   27                                              /**< Shift value for MODEM_EYEXESTFAST           */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_MASK                    0x8000000UL                                     /**< Bit mask for MODEM_EYEXESTFAST              */
#define _MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT                  (_MODEM_BCRDEMODARR0_EYEXESTFAST_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_SHIFT                     28                                              /**< Shift value for MODEM_ARRDETSRC             */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_MASK                      0x30000000UL                                    /**< Bit mask for MODEM_ARRDETSRC                */
#define _MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT                    (_MODEM_BCRDEMODARR0_ARRDETSRC_DEFAULT << 28)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRQPM                               (0x1UL << 30)                                   /**< ARRIVAL QUALIFY PM DET                      */
#define _MODEM_BCRDEMODARR0_ARRQPM_SHIFT                        30                                              /**< Shift value for MODEM_ARRQPM                */
#define _MODEM_BCRDEMODARR0_ARRQPM_MASK                         0x40000000UL                                    /**< Bit mask for MODEM_ARRQPM                   */
#define _MODEM_BCRDEMODARR0_ARRQPM_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRQPM_DEFAULT                       (_MODEM_BCRDEMODARR0_ARRQPM_DEFAULT << 30)      /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */
#define MODEM_BCRDEMODARR0_ARRDETEN                             (0x1UL << 31)                                   /**< ARRDETEN                                    */
#define _MODEM_BCRDEMODARR0_ARRDETEN_SHIFT                      31                                              /**< Shift value for MODEM_ARRDETEN              */
#define _MODEM_BCRDEMODARR0_ARRDETEN_MASK                       0x80000000UL                                    /**< Bit mask for MODEM_ARRDETEN                 */
#define _MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_BCRDEMODARR0         */
#define MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT                     (_MODEM_BCRDEMODARR0_ARRDETEN_DEFAULT << 31)    /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR0 */

/* Bit fields for MODEM BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_RESETVALUE                          0x80000000UL                                   /**< Default value for MODEM_BCRDEMODARR1        */
#define _MODEM_BCRDEMODARR1_MASK                                0xFFFFFFFFUL                                   /**< Mask for MODEM_BCRDEMODARR1                 */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_SHIFT                    0                                              /**< Shift value for MODEM_ARREYEQUAL            */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_MASK                     0x7FUL                                         /**< Bit mask for MODEM_ARREYEQUAL               */
#define _MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT                   (_MODEM_BCRDEMODARR1_ARREYEQUAL_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_SHIFT                    7                                              /**< Shift value for MODEM_EYEOPENTHD            */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_MASK                     0x3FF80UL                                      /**< Bit mask for MODEM_EYEOPENTHD               */
#define _MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT                   (_MODEM_BCRDEMODARR1_EYEOPENTHD_DEFAULT << 7)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_SHIFT                      18                                             /**< Shift value for MODEM_SYMBWMAX              */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_MASK                       0x7C0000UL                                     /**< Bit mask for MODEM_SYMBWMAX                 */
#define _MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT                     (_MODEM_BCRDEMODARR1_SYMBWMAX_DEFAULT << 18)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_SHIFT                      23                                             /**< Shift value for MODEM_SYMBWMIN              */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_MASK                       0x3800000UL                                    /**< Bit mask for MODEM_SYMBWMIN                 */
#define _MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT                     (_MODEM_BCRDEMODARR1_SYMBWMIN_DEFAULT << 23)   /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_BCRCFESRC                            (0x1UL << 26)                                  /**< BCR CFE INPUT SOURCE                        */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_SHIFT                     26                                             /**< Shift value for MODEM_BCRCFESRC             */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_MASK                      0x4000000UL                                    /**< Bit mask for MODEM_BCRCFESRC                */
#define _MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT                    (_MODEM_BCRDEMODARR1_BCRCFESRC_DEFAULT << 26)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_SHIFT                    27                                             /**< Shift value for MODEM_CFEQUALTHD            */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_MASK                     0x38000000UL                                   /**< Bit mask for MODEM_CFEQUALTHD               */
#define _MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT                   (_MODEM_BCRDEMODARR1_CFEQUALTHD_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_KSICOMPEN                            (0x1UL << 30)                                  /**< BCR KSI COMP. ENABLE                        */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_SHIFT                     30                                             /**< Shift value for MODEM_KSICOMPEN             */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_MASK                      0x40000000UL                                   /**< Bit mask for MODEM_KSICOMPEN                */
#define _MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT                   0x00000000UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT                    (_MODEM_BCRDEMODARR1_KSICOMPEN_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */
#define MODEM_BCRDEMODARR1_ENCFEQUAL                            (0x1UL << 31)                                  /**< Enable BCE CFE Qualifer                     */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_SHIFT                     31                                             /**< Shift value for MODEM_ENCFEQUAL             */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_MASK                      0x80000000UL                                   /**< Bit mask for MODEM_ENCFEQUAL                */
#define _MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT                   0x00000001UL                                   /**< Mode DEFAULT for MODEM_BCRDEMODARR1         */
#define MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT                    (_MODEM_BCRDEMODARR1_ENCFEQUAL_DEFAULT << 31)  /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR1 */

/* Bit fields for MODEM BCRDEMODARR2 */
#define _MODEM_BCRDEMODARR2_RESETVALUE                          0x00000000UL                                      /**< Default value for MODEM_BCRDEMODARR2        */
#define _MODEM_BCRDEMODARR2_MASK                                0x8000003FUL                                      /**< Mask for MODEM_BCRDEMODARR2                 */
#define _MODEM_BCRDEMODARR2_CONSYMOL_SHIFT                      0                                                 /**< Shift value for MODEM_CONSYMOL              */
#define _MODEM_BCRDEMODARR2_CONSYMOL_MASK                       0x1FUL                                            /**< Bit mask for MODEM_CONSYMOL                 */
#define _MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT                     (_MODEM_BCRDEMODARR2_CONSYMOL_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */
#define MODEM_BCRDEMODARR2_RAWDCHKALWAYON                       (0x1UL << 5)                                      /**< RAW DATA Quality Check Always on            */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_SHIFT                5                                                 /**< Shift value for MODEM_RAWDCHKALWAYON        */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_MASK                 0x20UL                                            /**< Bit mask for MODEM_RAWDCHKALWAYON           */
#define _MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT              0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT               (_MODEM_BCRDEMODARR2_RAWDCHKALWAYON_DEFAULT << 5) /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */
#define MODEM_BCRDEMODARR2_OUTRNGCHK                            (0x1UL << 31)                                     /**< OUT RANGE CHECK                             */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_SHIFT                     31                                                /**< Shift value for MODEM_OUTRNGCHK             */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_MASK                      0x80000000UL                                      /**< Bit mask for MODEM_OUTRNGCHK                */
#define _MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for MODEM_BCRDEMODARR2         */
#define MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT                    (_MODEM_BCRDEMODARR2_OUTRNGCHK_DEFAULT << 31)     /**< Shifted mode DEFAULT for MODEM_BCRDEMODARR2 */

